In [1]:
import pandas as pd
from sklearn import linear_model 
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv("carprices.csv")
df.head()

  Car Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

In [3]:
dummies=pd.get_dummies(df["Car Model"])
dummies.head()

   Audi A5  BMW X5  Mercedez Benz C class
0        0       1                      0
1        0       1                      0
2        0       1                      0
3        0       1                      0
4        0       1                      0

In [4]:
merges=pd.concat([df,dummies],axis="columns")
merges.head()

,Car Model,Mileage,Sell Price($),Age(yrs),Audi A5,BMW X5,Mercedez Benz C class
0,BMW X5,69000,18000,6,0,1,0
1,BMW X5,35000,34000,3,0,1,0
2,BMW X5,57000,26100,5,0,1,0
3,BMW X5,22500,40000,2,0,1,0
4,BMW X5,46000,31500,4,0,1,0

In [5]:
new_df=merges.drop(columns=["Car Model","Mercedez Benz C class"])
new_df.head()

   Mileage  Sell Price($)  Age(yrs)  Audi A5  BMW X5
0    69000          18000         6        0       1
1    35000          34000         3        0       1
2    57000          26100         5        0       1
3    22500          40000         2        0       1
4    46000          31500         4        0       1

In [6]:
x=new_df.drop(columns="Sell Price($)")
x.head()

   Mileage  Age(yrs)  Audi A5  BMW X5
0    69000         6        0       1
1    35000         3        0       1
2    57000         5        0       1
3    22500         2        0       1
4    46000         4        0       1

In [7]:
y=new_df["Sell Price($)"]
y.head()

0    18000
1    34000
2    26100
3    40000
4    31500
Name: Sell Price($), dtype: int64

In [11]:
model=linear_model.LinearRegression()

In [12]:
model.fit(x,y)

LinearRegression()

In [13]:
model.score(x,y)

0.9417050937281083

In [14]:
#1 predict the price of a mercedez benz that is 4yr old with mileage 45000
model.predict([[45000,4,1,0]])

C:\Users\Dafe\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([34537.77647335])

In [15]:
#predict price of a BMW X5 that is 7yr old with mileage 86000
model.predict([[86000,7,1,0]])

C:\Users\Dafe\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([15365.40972059])